In [126]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import math
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score
d=pd.read_csv('titanic.csv')

In [127]:
d.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [128]:
d.drop(['PassengerId','Name','Ticket','Embarked'],axis=1,inplace=True)

In [129]:
d.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Cabin
0         0       3    male  22.0      1      0   7.2500   NaN
1         1       1  female  38.0      1      0  71.2833   C85
2         1       3  female  26.0      0      0   7.9250   NaN
3         1       1  female  35.0      1      0  53.1000  C123
4         0       3    male  35.0      0      0   8.0500   NaN

In [130]:
d['family']=d['SibSp']+d['Parch']

In [131]:
d.drop(['SibSp','Parch'],axis=1,inplace=True)

In [132]:
d.head()

   Survived  Pclass     Sex   Age     Fare Cabin  family
0         0       3    male  22.0   7.2500   NaN       1
1         1       1  female  38.0  71.2833   C85       1
2         1       3  female  26.0   7.9250   NaN       0
3         1       1  female  35.0  53.1000  C123       1
4         0       3    male  35.0   8.0500   NaN       0

In [133]:
for i in range(len(d['Sex'])):
    if(d['Sex'][i]=="male"):
        d['Sex'][i]=1
    else:
        d['Sex'][i]=0

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [134]:
d.head()

   Survived  Pclass Sex   Age     Fare Cabin  family
0         0       3   1  22.0   7.2500   NaN       1
1         1       1   0  38.0  71.2833   C85       1
2         1       3   0  26.0   7.9250   NaN       0
3         1       1   0  35.0  53.1000  C123       1
4         0       3   1  35.0   8.0500   NaN       0

In [135]:
d.groupby(d['Age'].isnull()).mean()

       Survived    Pclass        Age       Fare    family
Age
False  0.406162  2.236695  29.699118  34.694514  0.943978
True   0.293785  2.598870        NaN  22.158567  0.745763

In [136]:
d['Age'].fillna(d['Age'].mean(),inplace=True)

In [137]:
print(d['Age'])

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [138]:
d['Cabin_Ind']=np.where(d['Cabin'].isnull(),0,1)

In [139]:
d.drop(['Cabin'],axis=1,inplace=True)

In [140]:
d.head()
label=d['Survived']
d.drop(['Survived'],axis=1,inplace=True)
X_train, X_test, y_train, y_test = train_test_split(d, label, test_size=0.3, random_state=42)

In [165]:
model=RandomForestClassifier(n_estimators=300,max_depth=5)

In [166]:
model.fit(X_train,y_train)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=5, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=300,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [167]:
X_pred=model.predict(X_test)

In [168]:
accuracy_score(y_test, X_pred)

0.8059701492537313